import React from 'react';

interface ContentState {
  firstElementClicked: boolean,
  secondElementClicked: boolean,
}


export default class Content extends React.Component<any, ContentState> {
  state: ContentState = {
    firstElementClicked: false,
    secondElementClicked: false,
  };

  render() {
    return <main>
      <div className="hobbies">
        <h2 id="first-element"
          className={this.state.firstElementClicked ? 'first-element__active' : ''}
          onClick={
            () => this.setState({ firstElementClicked: !this.state.firstElementClicked })}>
          Хоббі:</h2>
        <ul
          className={'second-element' + (
            this.state.secondElementClicked ?
              ' second-element__active' : '')}
          onClick={
            () => this.setState({ secondElementClicked: !this.state.secondElementClicked })}>
          <li>Програмування</li>
          <li>Лінгвістика</li>
          <li>Малювання</li>
        </ul>
      </div>
      <div className="films_books">
        <h2>Улюблені фільми/книги:</h2>
        <ul>
          <li>Interstellar</li>
          <li>A beatiful mind</li>
          <li>1984</li>
        </ul>
      </div>
      <div className="favourite_city">
        <h2>Улюблене місто:</h2>
        <p>Львів — місто в Україні, адміністративний центр області, агломерації, району, міської
          громади, національно-культурний та освітньо-науковий осередок країни, великий промисловий
          центр і транспортний вузол, вважається столицею Галичини та центром Західної України. За
          кількістю населення — сьоме місто країни (717 273 станом на 01.01.2022)[2].

          Львів заснував король Данило приблизно у 1231—1235 роках (перша згадка від 1256 року).
          Близько 1272 року місто стало столицею Королівства Русі (Галицько-Волинського князівства).
          Невдовзі після смерті князя Юрія II Львів на понад чотири століття опинився під владою
          Королівства Польського. 1356 року місто отримало маґдебурзьке право; в добу Середньовіччя
          Львів був важливим торговельним центром. За австрійського панування місто стало осередком
          українського та польського національного рухів. Після розпаду Австро-Угорщини восени 1918
          року Львів деякий час був столицею Західноукраїнської Народної Республіки, але після
          українсько-польської битви за місто в листопаді 1918 перейшов до Польщі, що в 1922-23 було
          визнано міжнародними пактами та угодами. Під час Другої світової війни місто захопив
          Радянський Союз, а згодом — Німеччина. Після війни було юридично закріплено ялтинську
          угоду 1945, за якою Східна Галичина і зокрема Львів лишався у складі Української РСР. 1946
          року між Польщею та УРСР відбувся обмін населення, який разом із наслідками війни суттєво
          вплинув на населення Львова. З 1991 року Львів перебуває у складі України.

          Історичний центр Львова занесено до списку Світової спадщини ЮНЕСКО. У місті розташована
          найбільша кількість пам`&aposяток архітектури в Україні[3]. 2009 року Львову надано звання
          Культурної столиці України[4]. Місто періодично посідає чільні місця в рейтингах
          туристичної та інвестиційної привабливості[5][6][7].
        </p>
        <a href="https://city-adm.lviv.ua/" target="_blank" rel="noreferrer">
          <img style={{ width: '600px' }}
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/%D0%9B%D0%B0%D1%82%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D1%84%D0%B5%D0%B4%D1%80%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80_%28%D0%9B%D1%8C%D0%B2%D1%96%D0%B2%29_16.jpg/1280px-%D0%9B%D0%B0%D1%82%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D1%84%D0%B5%D0%B4%D1%80%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80_%28%D0%9B%D1%8C%D0%B2%D1%96%D0%B2%29_16.jpg"
            alt="Lviv" />
        </a>
      </div>
    </main>;
  }
}
